sector7gp/EPP_Sentinel/firmware/esp32-cam-eth/sdkconfig.defaults
# Target
CONFIG_IDF_TARGET="esp32s3"

# PSRAM obligatoria para framebuffers JPEG. El módulo de esta placa es un
# ESP32-S3R8 (8MB PSRAM Octal integrada; el sufijo "R8" indica Octal SPI,
# a diferencia de los WROOM-1 "N4R2" que usan Quad SPI).
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_ESP32S3_SPIRAM_SUPPORT=y

# Flash: 16MB (W25Q128) en esta placa.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Ethernet SPI (W5500)
CONFIG_ETH_USE_SPI_ETHERNET=y
CONFIG_ETH_SPI_ETHERNET_W5500=y

# El radio WiFi no se usa (conectividad por Ethernet); se deja apagado en
# tiempo de ejecución en net_eth.c, no hace falta deshabilitarlo por Kconfig.

# Watchdog de tareas: reinicio automático ante cuelgues (RNF-001).
CONFIG_ESP_TASK_WDT_EN=y
CONFIG_ESP_TASK_WDT_PANIC=y

# mDNS y HTTP server para el portal de provisioning.
CONFIG_LWIP_DNS_SUPPORT_MDNS_QUERIES=y

# El default (512) no alcanza para los headers que mandan navegadores
# modernos (client hints, cookies, user-agent largo) al POST /save.
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
